Напишите программу, которая будет выдавать
название дня недели по заданному номеру.
3 -> Среда
5 -> Пятница

Console.WriteLine("Введите день недели");
int weekDay = Convert.ToInt32(Console.ReadLine());
